var str = "1.横須賀鎮守府 203.104.105.167 2.呉鎮守府 125.6.184.15 3.佐世保鎮守府 125.6.184.16 4.舞鶴鎮守府 125.6.187.205 5.大湊警備府 125.6.187.229 6.トラック泊地 125.6.187.253 7.リンガ泊地 125.6.188.25 8.ラバウル基地 203.104.248.135 9.ショートランド泊地 125.6.189.7 10.ブイン基地 125.6.189.39 11.タウイタウイ泊地 125.6.189.71 12.パラオ泊地 125.6.189.103 13.ブルネイ泊地 125.6.189.135 14.単冠湾泊地 125.6.189.167 15.幌筵泊地 125.6.189.215 16.宿毛湾泊地 125.6.189.247 17.鹿屋基地 203.104.209.23 18.岩川基地 203.104.209.39 19.佐伯湾泊地 203.104.209.55 20.柱島泊地 203.104.209.102 21.新呉 203.104.209.87";
var regex = /.([^\d]+) (\d+.\d+.\d+.\d+)/g
var json = ""

var res;
while(1){
  res = regex.exec(str);
  if(res === null)
    break;
  json += "\"" + res[1] + "\":\"" + res[2] + "\",\n";
}